const { v4: uuidv4 } = require("uuid");
module.exports = {
  gadgets: [
    {
      brand: "Apple",
      mobiles: [
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 14 Pro Max",
          current_bundle: {
            memory: 256,
            price: "671 521 ₸",
          },
          bundle: [
            {
              memory: 256,
              price: "671 521 ₸",
            },
            {
              memory: 512,
              price: "700 000 ₸",
            },
            {
              memory: 1000,
              price: "750 000 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I14ProMax/black/image1.jpg",
              "../assets/apple/mobiles/I14ProMax/black/image2.jpg",
              "../assets/apple/mobiles/I14ProMax/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I14ProMax/black/image1.jpg",
                "../assets/apple/mobiles/I14ProMax/black/image2.jpg",
                "../assets/apple/mobiles/I14ProMax/black/image3.jpg",
              ],
            },
            {
              color: "серебристый",
              images: [
                "../assets/apple/mobiles/I14ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I14ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I14ProMax/silver/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I14ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I14ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I14ProMax/gold/image3.jpg",
              ],
            },
          ],
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "6-ядерный Apple A16 Bionic",
          battery_capacity: "3095.0 мАч",
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 14 Pro",
          current_bundle: {
            memory: 256,
            price: "613 000 ₸",
          },
          bundle: [
            {
              memory: 256,
              price: "613 000 ₸",
            },
            {
              memory: 512,
              price: "650 000 ₸",
            },
            {
              memory: 1000,
              price: "700 000 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I14ProMax/black/image1.jpg",
              "../assets/apple/mobiles/I14ProMax/black/image2.jpg",
              "../assets/apple/mobiles/I14ProMax/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I14ProMax/black/image1.jpg",
                "../assets/apple/mobiles/I14ProMax/black/image2.jpg",
                "../assets/apple/mobiles/I14ProMax/black/image3.jpg",
              ],
            },
            {
              color: "серебристый",
              images: [
                "../assets/apple/mobiles/I14ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I14ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I14ProMax/silver/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I14ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I14ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I14ProMax/gold/image3.jpg",
              ],
            },
          ],
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "6-ядерный Apple A16 Bionic",
          battery_capacity: "3125 мАч",
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 14",
          current_bundle: {
            memory: 256,
            price: "410 960 ₸",
          },
          bundle: [
            {
              memory: 256,
              price: "410 960 ₸",
            },
            {
              memory: 512,
              price: "450 000 ₸",
            },
            {
              memory: 1000,
              price: "500 000 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "черный",
            images: [
              "../assets/apple/mobiles/I14/black/image1.jpg",
              "../assets/apple/mobiles/I14/black/image2.jpg",
              "../assets/apple/mobiles/I14/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "черный",
              images: [
                "../assets/apple/mobiles/I14/black/image1.jpg",
                "../assets/apple/mobiles/I14/black/image2.jpg",
                "../assets/apple/mobiles/I14/black/image3.jpg",
              ],
            },
            {
              color: "красный",
              images: [
                "../assets/apple/mobiles/I14/red/image1.jpg",
                "../assets/apple/mobiles/I14/red/image2.jpg",
                "../assets/apple/mobiles/I14/red/image3.jpg",
              ],
            },
            {
              color: "жёлтый",
              images: [
                "../assets/apple/mobiles/I14/yellow/image1.jpg",
                "../assets/apple/mobiles/I14/yellow/image2.jpg",
                "../assets/apple/mobiles/I14/yellow/image3.jpg",
              ],
            },
          ],
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "6-ядерный Apple A15 Bionic",
          battery_capacity: "3279 мАч",
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 13 Pro Max",
          current_bundle: {
            memory: 256,
            price: "690 448 ₸",
          },
          bundle: [
            {
              memory: 128,
              price: "597 700 ₸",
            },
            {
              memory: 256,
              price: "690 448 ₸",
            },
            {
              memory: 512,
              price: "730 448 ₸",
            },
            {
              memory: 1000,
              price: "760 000 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "зелёный",
            images: [
              "../assets/apple/mobiles/I13ProMax/green/image1.jpg",
              "../assets/apple/mobiles/I13ProMax/green/image2.jpg",
              "../assets/apple/mobiles/I13ProMax/green/image3.jpg",
            ],
          },
          types: [
            {
              color: "зелёный",
              images: [
                "../assets/apple/mobiles/I13ProMax/green/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/green/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/green/image3.jpg",
              ],
            },
            {
              color: "серебристый",
              images: [
                "../assets/apple/mobiles/I13ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/silver/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I13ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/gold/image3.jpg",
              ],
            },
          ],
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "6-ядерный Apple A15 Bionic",
          battery_capacity: "4352.0 мАч",
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 13 Pro",
          current_bundle: {
            memory: 256,
            price: "650 448 ₸",
          },
          bundle: [
            {
              memory: 128,
              price: "567 700 ₸",
            },
            {
              memory: 256,
              price: "650 448 ₸",
            },
            {
              memory: 512,
              price: "680 448 ₸",
            },
            {
              memory: 1000,
              price: "720 000 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "зелёный",
            images: [
              "../assets/apple/mobiles/I13ProMax/green/image1.jpg",
              "../assets/apple/mobiles/I13ProMax/green/image2.jpg",
              "../assets/apple/mobiles/I13ProMax/green/image3.jpg",
            ],
          },
          types: [
            {
              color: "зелёный",
              images: [
                "../assets/apple/mobiles/I13ProMax/green/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/green/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/green/image3.jpg",
              ],
            },
            {
              color: "серебристый",
              images: [
                "../assets/apple/mobiles/I13ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/silver/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I13ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/gold/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "6-ядерный Apple A15 Bionic",
          battery_capacity: "3095 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 13",
          current_bundle: {
            memory: 256,
            price: "446 300 ₸",
          },
          bundle: [
            {
              memory: 128,
              price: "390 300 ₸",
            },
            {
              memory: 256,
              price: "446 300 ₸",
            },
            {
              memory: 512,
              price: "500 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I13/black/image1.jpg",
              "../assets/apple/mobiles/I13/black/image2.jpg",
              "../assets/apple/mobiles/I13/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I13/black/image1.jpg",
                "../assets/apple/mobiles/I13/black/image2.jpg",
                "../assets/apple/mobiles/I13/black/image3.jpg",
              ],
            },
            {
              color: "розовый",
              images: [
                "../assets/apple/mobiles/I13ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I13ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I13ProMax/silver/image3.jpg",
              ],
            },
            {
              color: "синий",
              images: [
                "../assets/apple/mobiles/I13/blue/image1.jpg",
                "../assets/apple/mobiles/I13/blue/image2.jpg",
                "../assets/apple/mobiles/I13/blue/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "6-ядерный Apple A15 Bionic",
          battery_capacity: "3095 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 12 Pro Max",
          current_bundle: {
            memory: 256,
            price: "560 300 ₸",
          },
          bundle: [
            {
              memory: 128,
              price: "500 300 ₸",
            },
            {
              memory: 256,
              price: "560 300 ₸",
            },
            {
              memory: 512,
              price: "600 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I12ProMax/black/image1.jpg",
              "../assets/apple/mobiles/I12ProMax/black/image2.jpg",
              "../assets/apple/mobiles/I12ProMax/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I12ProMax/black/image1.jpg",
                "../assets/apple/mobiles/I12ProMax/black/image2.jpg",
                "../assets/apple/mobiles/I12ProMax/black/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I12ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I12ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I12ProMax/gold/image3.jpg",
              ],
            },
            {
              color: "серебристый",
              images: [
                "../assets/apple/mobiles/I12ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I12ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I12ProMax/silver/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "OLED Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "Apple A14 Bionic",
          battery_capacity: "3687.0 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 12 Pro",
          current_bundle: {
            memory: 256,
            price: "520 300 ₸",
          },
          bundle: [
            {
              memory: 128,
              price: "460 300 ₸",
            },
            {
              memory: 256,
              price: "520 300 ₸",
            },
            {
              memory: 512,
              price: "570 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I12ProMax/black/image1.jpg",
              "../assets/apple/mobiles/I12ProMax/black/image2.jpg",
              "../assets/apple/mobiles/I12ProMax/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I12ProMax/black/image1.jpg",
                "../assets/apple/mobiles/I12ProMax/black/image2.jpg",
                "../assets/apple/mobiles/I12ProMax/black/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I12ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I12ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I12ProMax/gold/image3.jpg",
              ],
            },
            {
              color: "серебристый",
              images: [
                "../assets/apple/mobiles/I12ProMax/silver/image1.jpg",
                "../assets/apple/mobiles/I12ProMax/silver/image2.jpg",
                "../assets/apple/mobiles/I12ProMax/silver/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "Apple A14 Bionic",
          battery_capacity: "3295 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 12",
          current_bundle: {
            memory: 128,
            price: "360 300 ₸",
          },
          bundle: [
            {
              memory: 64,
              price: "320 300 ₸",
            },
            {
              memory: 128,
              price: "360 300 ₸",
            },
            {
              memory: 256,
              price: "440 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I12/black/image1.jpg",
              "../assets/apple/mobiles/I12/black/image2.jpg",
              "../assets/apple/mobiles/I12/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I12/black/image1.jpg",
                "../assets/apple/mobiles/I12/black/image2.jpg",
                "../assets/apple/mobiles/I12/black/image3.jpg",
              ],
            },
            {
              color: "зелёный",
              images: [
                "../assets/apple/mobiles/I12/green/image1.jpg",
                "../assets/apple/mobiles/I12/green/image2.jpg",
                "../assets/apple/mobiles/I12/green/image3.jpg",
              ],
            },
            {
              color: "фиолетовый",
              images: [
                "../assets/apple/mobiles/I12/violet/image1.jpg",
                "../assets/apple/mobiles/I12/violet/image2.jpg",
                "../assets/apple/mobiles/I12/violet/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "OLED, Super Retina XDR",
          RAM: "6 ГБ",
          CPU: "Apple A14 Bionic",
          battery_capacity: "2815.0 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 11 Pro Max",
          current_bundle: {
            memory: 128,
            price: "450 300 ₸",
          },
          bundle: [
            {
              memory: 64,
              price: "400 300 ₸",
            },
            {
              memory: 128,
              price: "450 300 ₸",
            },
            {
              memory: 256,
              price: "500 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I12/black/image1.jpg",
              "../assets/apple/mobiles/I12/black/image2.jpg",
              "../assets/apple/mobiles/I12/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I11ProMax/black/image1.jpg",
                "../assets/apple/mobiles/I11ProMax/black/image2.jpg",
                "../assets/apple/mobiles/I11ProMax/black/image3.jpg",
              ],
            },
            {
              color: "зелёный",
              images: [
                "../assets/apple/mobiles/I11ProMax/green/image1.jpg",
                "../assets/apple/mobiles/I11ProMax/green/image2.jpg",
                "../assets/apple/mobiles/I11ProMax/green/image3.jpg",
              ],
            },
            {
              color: "золотистый",
              images: [
                "../assets/apple/mobiles/I11ProMax/gold/image1.jpg",
                "../assets/apple/mobiles/I11ProMax/gold/image2.jpg",
                "../assets/apple/mobiles/I11ProMax/gold/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "Super Retina XDR с технологией OLED Multi-Touch",
          RAM: "6 ГБ",
          CPU: "A13 Bionic",
          battery_capacity: "3500.0 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 11 Pro",
          current_bundle: {
            memory: 128,
            price: "420 300 ₸",
          },
          bundle: [
            {
              memory: 64,
              price: "370 300 ₸",
            },
            {
              memory: 128,
              price: "420 300 ₸",
            },
            {
              memory: 256,
              price: "480 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I12/black/image1.jpg",
              "../assets/apple/mobiles/I12/black/image2.jpg",
              "../assets/apple/mobiles/I12/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I12/black/image1.jpg",
                "../assets/apple/mobiles/I12/black/image2.jpg",
                "../assets/apple/mobiles/I12/black/image3.jpg",
              ],
            },
            {
              color: "зелёный",
              images: [
                "../assets/apple/mobiles/I12/green/image1.jpg",
                "../assets/apple/mobiles/I12/green/image2.jpg",
                "../assets/apple/mobiles/I12/green/image3.jpg",
              ],
            },
            {
              color: "фиолетовый",
              images: [
                "../assets/apple/mobiles/I12/violet/image1.jpg",
                "../assets/apple/mobiles/I12/violet/image2.jpg",
                "../assets/apple/mobiles/I12/violet/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "OLED, Super Retina XDR",
          RAM: "4 ГБ",
          CPU: "Apple A14 Bionic",
          battery_capacity: "2815.0 мАч",
        },
        {
          id: uuidv4(),
          model: "Смартфон Apple iPhone 11",
          current_bundle: {
            memory: 128,
            price: "320 300 ₸",
          },
          bundle: [
            {
              memory: 64,
              price: "260 300 ₸",
            },
            {
              memory: 128,
              price: "320 300 ₸",
            },
            {
              memory: 256,
              price: "360 448 ₸",
            },
          ],
          reviews: [
            {
              author: "",
              content: "",
            },
          ],
          current_type: {
            color: "чёрный",
            images: [
              "../assets/apple/mobiles/I11/black/image1.jpg",
              "../assets/apple/mobiles/I11/black/image2.jpg",
              "../assets/apple/mobiles/I11/black/image3.jpg",
            ],
          },
          types: [
            {
              color: "чёрный",
              images: [
                "../assets/apple/mobiles/I11/black/image1.jpg",
                "../assets/apple/mobiles/I11/black/image2.jpg",
                "../assets/apple/mobiles/I11/black/image3.jpg",
              ],
            },
            {
              color: "белый",
              images: [
                "../assets/apple/mobiles/I11/white/image1.jpg",
                "../assets/apple/mobiles/I11/white/image2.jpg",
                "../assets/apple/mobiles/I11/white/image3.jpg",
              ],
            },
            {
              color: "красный",
              images: [
                "../assets/apple/mobiles/I11/red/image1.jpg",
                "../assets/apple/mobiles/I11/red/image2.jpg",
                "../assets/apple/mobiles/I11/red/image3.jpg",
              ],
            },
          ],
          description: `
          Apple iPhone 13 Pro получил дисплей 6.1 дюйма Super Retina XDR1 с адаптивной частотой обновления до 120 Гц и технологией ProMotion для более быстрого и плавного взаимодействия. Благодаря передней панели Ceramic Shield экран защищен от трещин, царапин и других мелких повреждений. Способность дисплея обновляться с частотой до 120 Гц в сочетании с потрясающей графической производительностью нового графического процессора на базе чипа A15 Bionic делают iPhone 13 Pro незаменимым устройством для настоящих геймеров. Обновленная система камер Pro (12 Мп + 12 Мп + 12 Мп) позволяет передать еще больше деталей. Новая сверхширокоугольная камера с обновленным объективом и мощной системой автофокуса теперь может снимать на расстоянии всего 2 см от объекта. Самые мелкие детали будут выглядеть масштабно — узор листа, лапки насекомого или капля росы. Apple iPhone 13 Pro создан для съемки при слабом освещении. Широкоугольная камера с увеличенной диафрагмой и самой большой матрицей использует возможности сканера LiDAR для портретов в Ночном режиме. А у телефотокамеры появился Ночной режим. Фокусное расстояние 77 мм и трехкратный оптический зум — идеальные параметры для классических портретных кадров или съемки фото и видео издалека. А если объект находится вблизи, можно настраивать степень размытия фона и экспериментировать с эффектами студийного освещения в Портретном режиме. Фотографические стили позволяют применить к вашим кадрам выбранные параметры тона и теплоты. При этом оттенки неба и кожи остаются естественными — достичь такого эффекта с обычными фильтрами не получится. Если захотите, можно выставить более точные параметры для нужного стиля. Настроить стиль съемки по вашему вкусу достаточно один раз, и он будет применяться автоматически. Это первый смартфон Apple, на котором можно полностью снять и отредактировать фильм в формате ProRes или в стандарте Dolby Vision. ProRes подразумевает высокую четкость изображения и низкую степень сжатия. Поэтому прямо на ходу вы можете создавать видеоконтент, готовый к публикациям и презентациям. Теперь проект в ProRes можно начать и закончить прямо на iPhone. Smart HDR 4 позволяет автоматически отрегулировать контрастность, освещение и оттенок кожи для каждого человека. Чтобы все получились просто идеально. Если в кадре недостаточно света, на помощь приходит технология Deep Fusion. Вместе с системой Neural Engine она анализирует все пиксели изображения, снятого с различными экспозициями. Из самых удачных областей формируется финальное изображение, в котором максимум деталей и самые тончайшие текстуры. Процессор A15 Bionic и камера TrueDepth также обеспечивают работу Face ID, исключительно надежной технологии аутентификации. Apple iPhone 13 Pro работает от аккумулятора на 1.5 часа дольше любого другого iPhone.
          `,
          screen_type: "IPS, Liquid Retina HD",
          RAM: "4 ГБ",
          CPU: "6-ядерный Apple A13 Bionic",
          battery_capacity: "3110.0 мАч",
        },
      ],
      chargers: [
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple 18W USB-C Power Adapter белый",
          price: "10 155 ₸",
          type: "сетевая зарядка",
          fast_charge: false,
          connector_type: "USB Type-C",
          images: [
            "../assets/apple/chargers/Adapter18W/image1.jpg",
            "../assets/apple/chargers/Adapter18W/image2.jpg",
            "../assets/apple/chargers/Adapter18W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter18W/image1.jpg",
              "../assets/apple/chargers/Adapter18W/image2.jpg",
              "../assets/apple/chargers/Adapter18W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple 20W USB-C Power Adapter белый",
          price: "9 484 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB Type-C",
          images: [
            "../assets/apple/chargers/Adapter20W/image1.jpg",
            "../assets/apple/chargers/Adapter20W/image2.jpg",
            "../assets/apple/chargers/Adapter120W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter20W/image1.jpg",
              "../assets/apple/chargers/Adapter20W/image2.jpg",
              "../assets/apple/chargers/Adapter120W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple 20W USB-C Power Adapter (Type A)",
          price: "11 966 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB Type-C",
          images: [
            "../assets/apple/chargers/Adapter20WTypeA/image1.jpg",
            "../assets/apple/chargers/Adapter20WTypeA/image2.jpg",
            "../assets/apple/chargers/Adapter20WTypeA/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter20WTypeA/image1.jpg",
              "../assets/apple/chargers/Adapter20WTypeA/image2.jpg",
              "../assets/apple/chargers/Adapter20WTypeA/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple 5W USB Power Adapter",
          price: "8 866 ₸",
          type: "сетевая зарядка",
          fast_charge: false,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/Adapter5W/image1.jpg",
            "../assets/apple/chargers/Adapter5W/image2.jpg",
            "../assets/apple/chargers/Adapter5W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter5W/image1.jpg",
              "../assets/apple/chargers/Adapter5W/image2.jpg",
              "../assets/apple/chargers/Adapter5W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple 20W USB-C Power Adapter (Type G)",
          price: "11 975 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/Adapter20WTypeG/image1.jpg",
            "../assets/apple/chargers/Adapter20WTypeG/image2.jpg",
            "../assets/apple/chargers/Adapter20WTypeG/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter20WTypeG/image1.jpg",
              "../assets/apple/chargers/Adapter20WTypeG/image2.jpg",
              "../assets/apple/chargers/Adapter20WTypeG/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple 12W USB Power Adapter",
          price: "13 898 ₸",
          type: "сетевая зарядка",
          fast_charge: false,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/Adapter12W/image1.jpg",
            "../assets/apple/chargers/Adapter12W/image2.jpg",
            "../assets/apple/chargers/Adapter12W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter12W/image1.jpg",
              "../assets/apple/chargers/Adapter12W/image2.jpg",
              "../assets/apple/chargers/Adapter12W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Блок питания Apple 30W USB-C Power Adapter",
          price: "29 850 ₸",
          type: "сетевая зарядка",
          fast_charge: false,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/Adapter30W/image1.jpg",
            "../assets/apple/chargers/Adapter30W/image2.jpg",
            "../assets/apple/chargers/Adapter30W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter30W/image1.jpg",
              "../assets/apple/chargers/Adapter30W/image2.jpg",
              "../assets/apple/chargers/Adapter30W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Блок питания Apple 45W MagSafe 2 Power Adapter",
          price: "28 490 ₸",
          type: "сетевая зарядка",
          fast_charge: false,
          connector_type: "USB",
          images: ["../assets/apple/chargers/MagSafe245W/image1.jpg"],
          current_type: {
            images: ["../assets/apple/chargers/MagSafe245W/image1.jpg"],
          },
        },
        {
          id: uuidv4(),
          model: "Блок питания Apple MagSafe 2 60W белый",
          price: "28 890 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/MagSafe260W/image1.jpg",
            "../assets/apple/chargers/MagSafe260W/image2.jpg",
            "../assets/apple/chargers/MagSafe260W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/MagSafe260W/image1.jpg",
              "../assets/apple/chargers/MagSafe260W/image2.jpg",
              "../assets/apple/chargers/MagSafe260W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model:
            "Блок питания Apple 61W USB-C Power Adapter + Apple USB-C - USB-C 2 м",
          price: "39 974 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/Adapter61W/image1.jpg",
            "../assets/apple/chargers/Adapter61W/image2.jpg",
            "../assets/apple/chargers/Adapter61W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter61W/image1.jpg",
              "../assets/apple/chargers/Adapter61W/image2.jpg",
              "../assets/apple/chargers/Adapter61W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Блок питания Apple 67W USB-C Power Adapter",
          price: "41 979 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/Adapter67W/image1.jpg",
            "../assets/apple/chargers/Adapter67W/image2.jpg",
            "../assets/apple/chargers/Adapter67W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/Adapter67W/image1.jpg",
              "../assets/apple/chargers/Adapter67W/image2.jpg",
              "../assets/apple/chargers/Adapter67W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Блок питания Apple MagSafe 2 85W белый",
          price: "20 550 ₸",
          type: "сетевая зарядка",
          fast_charge: true,
          connector_type: "USB",
          images: [
            "../assets/apple/chargers/MagSafe85W/image1.jpg",
            "../assets/apple/chargers/MagSafe85W/image2.jpg",
            "../assets/apple/chargers/MagSafe85W/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/MagSafe85W/image1.jpg",
              "../assets/apple/chargers/MagSafe85W/image2.jpg",
              "../assets/apple/chargers/MagSafe85W/image3.jpg",
            ],
          },
        },
        {
          id: uuidv4(),
          model: "Зарядное устройство Apple MagSafe Duo Charger",
          price: "74 856 ₸",
          type: "сетевая зарядка",
          fast_charge: false,
          connector_type: "Lightning",
          images: [
            "../assets/apple/chargers/DuoCharger/image1.jpg",
            "../assets/apple/chargers/DuoCharger/image2.jpg",
            "../assets/apple/chargers/DuoCharger/image3.jpg",
          ],
          current_type: {
            images: [
              "../assets/apple/chargers/DuoCharger/image1.jpg",
              "../assets/apple/chargers/DuoCharger/image2.jpg",
              "../assets/apple/chargers/DuoCharger/image3.jpg",
            ],
          },
        },
      ],
      clocks: [
        {
          model: "Смарт-часы Apple Watch Series 8",
          current_type: {
            images: [
              "../assets/apple/clocks/S8/black/image1.jpg",
              "../assets/apple/clocks/S8/black/image2.jpg",
              "../assets/apple/clocks/S8/black/image3.jpg",
            ],
          },
          colors: {
            red: [
              "../assets/apple/clocks/S8/red/image1.jpg",
              "../assets/apple/clocks/S8/red/image2.jpg",
            ],
            silver: [
              "../assets/apple/clocks/S8/silver/image1.jpg",
              "../assets/apple/clocks/S8/silver/image2.jpg",
              "../assets/apple/clocks/S8/silver/image3.jpg",
            ],
            black: [
              "../assets/apple/clocks/S8/black/image1.jpg",
              "../assets/apple/clocks/S8/black/image2.jpg",
              "../assets/apple/clocks/S8/black/image3.jpg",
            ],
          },
          current_bundle: {
            size: 41,
            price: "199 497 ₸",
          },
          bundles: [
            {
              size: 41,
              price: "199 497 ₸",
            },
            {
              size: 45,
              price: "230 497 ₸",
            },
          ],
          autonomy: 18,
          energy_saving: 36,
          material: "алюминий",
          screen: "OLED",
          memory: 32,
        },
      ],
    },
  ],
};
